app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all
---
SELECT `users`.* FROM `users`